sarniva/edge_wake/sdkconfig.defaults
# Default target
CONFIG_IDF_TARGET="esp32s3"
# Our board: 16MB quad flash (detected via esptool flash_id) + 8MB octal PSRAM
# (present on the module, but this firmware no longer uses PSRAM at all)
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
# Fast console so mel/power hex dumps finish quickly
CONFIG_ESP_CONSOLE_UART_CUSTOM=y
CONFIG_ESP_CONSOLE_UART_BAUDRATE=921600
# Run at full speed from now on (KWS inference needs it; also
# makes "10% CPU" math consistent across all later phases)
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
# Main task hosts the listening loop + printf-heavy dumps: give it room
# (KWS inference will need this too)
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
# esp-dsp FFT table: we only ever need 512-pt (frontend NFFT)
CONFIG_DSP_MAX_FFT_SIZE_512=y
# Keep log informative but not noisy
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
